In [3]:
import pandas as pd

In [2]:
students = [ ('jack', 'Apples' , 34) ,
             ('Riti', 'Mangos'  , 31) ,
             ('Aadi', 'Grapes' , 30) ,
             ('Sonia', 'Apples', 32) ,
             ('Lucy', 'Mangos'  , 33) ,
             ('Mike', 'Apples' , 35)
              ]
students

[('jack', 'Apples', 34),
 ('Riti', 'Mangos', 31),
 ('Aadi', 'Grapes', 30),
 ('Sonia', 'Apples', 32),
 ('Lucy', 'Mangos', 33),
 ('Mike', 'Apples', 35)]

In [5]:
#Create a DataFrame object
dfObj = pd.DataFrame(students, columns = ['Name' , 'Product', 'Sale']) #给列添加列名
dfObj

    Name Product  Sale
0   jack  Apples    34
1   Riti  Mangos    31
2   Aadi  Grapes    30
3  Sonia  Apples    32
4   Lucy  Mangos    33
5   Mike  Apples    35

In [7]:
subsetDataFrame = dfObj[dfObj['Product'] == 'Apples']
subsetDataFrame

    Name Product  Sale
0   jack  Apples    34
3  Sonia  Apples    32
5   Mike  Apples    35

In [8]:
dfObj['Product'] == 'Apples'

0     True
1    False
2    False
3     True
4    False
5     True
Name: Product, dtype: bool

In [11]:
subsetDataFrame = dfObj[dfObj['Product'].isin(['Mangos', 'Grapes']) ]# 满足product这个列=Mangos 和 Grapes 两个条件

subsetDataFrame

   Name Product  Sale
1  Riti  Mangos    31
2  Aadi  Grapes    30
4  Lucy  Mangos    33

In [13]:
filterinfDataframe = dfObj[(dfObj['Sale'] > 30) & (dfObj['Sale'] < 33) ] # 列满足多个条件大于30，小于33

filterinfDataframe

    Name Product  Sale
1   Riti  Mangos    31
3  Sonia  Apples    32